{
    "reviews": [
      {
        "title": "Brave drama that is seldom told",
        "username": "allan-36",
        "date": "2000-08-14",
        "reviewText": "Mina Shum's Double Happiness bravely explores a group that mainstream film (read: Hollywood) continues to ignore: Asians in North America. That the film features strong acting, good writing and confident direction makes its accomplishments all the more greater. You don't need to be Asian to enjoy this film, anymore than you have to be Italian to watch The Godfathers. Young women of whatever ethnic backgrounds are bound to identify with the lead character, finely played by Sandra Oh. The daughter-father conflict crosses all national boundaries, and is explored in this film through the eyes of Chinese-Canadians. I'm a Canadian of Chinese descent, and found the characterizations of the family to be accurate overall. At times, the domineering Father is one-dimensional (tyrannical and cold) and needed to be fleshed out more. The role of the siblings--especially towards their parents--was underplayed and could have offered a contrast to the main relationship between the elder daughter and Dad. Still, the strict traditionalism of the parents was on the nose, and the struggles of the daughter, Jade, ring true. In fact, I venture to say that Jade was played *too* obediently, and should have broken from her family sooner. Following this line of thought, the film could have been expanded to explore Jade moving into her own home and finding her own career as an actress, then reconciling (perhaps) with her stern Father at the end. As it stands, the movie ends abruptly and too soon. Shum and Oh do a fine job of getting Jade on the audience's side, only pull the carpet on her just as she leaves home. The movie begs for closure in the relationship between daughter and father. Perhaps in the sequel.",
        "link": "https://www.imdb.com/review/rw0337677/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "Immigrant Challenges"],
        "movie": "Double Happiness"
      },
      {
        "title": "Sandra Oh is mesmerizing",
        "username": "rosscinema",
        "date": "2003-04-26",
        "reviewText": "Mina Shum wrote and directed this story of a Chinese-Canadian family in Vancouver with the central character being Jade (Sandra Oh). Jade's father Quo (Stephen Chang) is very strict about his children following old Chinese traditions and if they don't then they are disowned by him. So Jade actually tries to live two separate lives, one an obedient daughter who goes along with her fathers wishes (For the most part) and when she is out with her friends she can be a normal woman in her early 20's who talk about boys and goes to clubs. Jade wants to be an actress much to the chagrin of her parents and she goes out on auditions. One night she meets a man named Mark who is white and they have a one night stand. Jade's parents do not know him at first and fix her up on dates with Chinese men. They're is some excellent visual imagery in the film and in one scene Jade and Mark are on swings and the shot is in slow motion with a good and effective musical score to enhance the visual flair. In another scene a fed up Jade gets out of the car of another date and starts to run down the street. We are not told where she is running to but we must assume its to Mark. Sandra Oh's performance seems to be flawless. Watching her character ultimately give up trying to please her father is just riveting to watch. I've always been a big fan of Oh's and I thought she was equally terrific in 'Dancing at the Blue Iguana'. Oh takes the character of Jade and makes her not only smart and strong, but makes her very human also! When a casting director asks her how could she possibly think of herself as Chinese if she cannot read it, Jade at this point in the film questions herself and ultimately comes to a life changing decision. Mina Shums script is sharp and she doesn't portray Jade's parents as one dimensional. They have issues as well and it affects the lives of their children. Well written script gives Oh the opportunity to give a totally convincing and haunting performance.",
        "link": "https://www.imdb.com/review/rw0337688/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "Visual Appeal and Performances"],
        "movie": "Double Happiness"
      },
      {
        "title": "A Wonderful, Funny, Heartfelt Movie",
        "username": "chriscavanagh",
        "date": "2005-05-31",
        "reviewText": "I recently saw a list and short synopses of the screenplays accepted for the Sundance Screenwriters Lab. In short the overall subject matter seemed to be death, doom and depression, i.e. serious subjects for serious films. I am sure that many good and possibly some great scripts and films will come out of the program.Comedy is hard. Really hard. Okay, I'm willing to concede that teenage gross out bathroom humor movies probably aren't too difficult, and don't get me wrong I enjoy a good gastro-intestinal joke as much as the next person, but a movie that makes you laugh (a lot), touches your heart and just plain makes you feel good... well I think that is something quite rare -- especially these days.Saving Face is one of the funniest, warmest, most heartfelt movies I have seen in a long, long time. Its a smart, insightful movie for adults. And like any really really good romantic comedy it is about much more than what is on the surface. I really don't care that it is Alice Wu's first film (although that makes her accomplishment all the more extraordinary) -- all I care about is that it isn't her last.",
        "link": "https://www.imdb.com/review/rw1092386/?ref_=rw_urv",
        "tags": ["Directorial Focus", "Visual Appeal and Performances", "Happy Ending"],
        "movie": "Saving Face"
      },
      {
        "title": "A nice, light comedy worth seeing",
        "username": "Proud_Canadian",
        "date": "2004-09-12",
        "reviewText": "I was fortunate to see the World premier at the Toronto Film Festival. It was an almost finished product with only some minor changes still needing to be done (mostly tweaking the temporary score and sound) but I didn't notice that it wasn't a finished product. Saving Face is a funny film by written and directed by first time director: Alice Wu. It is about a widow (Joan Chen) who is in her late-40's and has a daughter who is a surgeon. She tries to set up her daughter at these Chinese dances that happen once a week but the daughter is not interested. One day the woman shows up on the daughter's doorstep, kicked out of her home because she has brought shame to the family by becoming pregnant out of wedlock. The mother and daughter have to adjust while the daughter tries to hide her lesbian relationship with her boss's daughter. I liked this film. Joan Chen was very funny in this film. The comedy is good, a nice light touch and on a level everyone can relate too. Although, the fact they are Chinese is not glossed over. The dramatic scenes were weaker in contrast to the comedy but still worked. The three main actresses were good although Joan Chen was the star. If you liked What's Cooking or Mambo Italiano or My Big Fat Greek Wedding, then I think you will like this movie. I am Asian but not Chinese so I do have my biases. Having said that, I think that this film will help break the typical Asian stereotype and will be a mainstream success. Apparently Sony pictures has bought the distribution rights so I expect to see it in theatre some time next year. I give it an 8/10. Definitely worth a look if you want a nice light comedy with a little drama. Note the film is half in Mandarin and half in English but there are English subtitles. I will definitely see it again when it comes out in general release and I will buy the DVD when it comes out.",
        "link": "https://www.imdb.com/review/rw0933855/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "Immigrant Challenges"],
        "movie": "Saving Face"
      },
      {
        "title": "Delicate and Delightful Romance",
        "username": "claudio_carvalho",
        "date": "2008-01-17",
        "reviewText": "In Manhattan, the brilliant Chinese-American lesbian surgeon Wil (Michelle Krusiec) is surprised by the arrival of her forty-eight years old widow mother (Joan Chen) to her apartment. Ma was banished from Flushing, Queens, when her father discovered that she was pregnant. The presence of Ma affects the personal life of Wil, who is in love with the daughter of her boss in the hospital, the dancer Vivian Shing (Lynn Chen). Once her grandfather has promised that her mother would only return to Flushing remarried or proving that it was an immaculate conception, Wil tries to find a bachelor Chinese to marry Ma."Saving Face" is a delicate and delightful romance that explores the clash of cultures of different generations in a Chinese community. The quote: "- The world is getting too hard to predict" defines the conflictive situation of the conservative old generation seeing the modifications of behavior in the younger generations raised in a different culture in their new country. The gorgeous actresses have convincing performances is this entertaining fell-good romantic comedy. My vote is seven. Title (Brazil): "Livrando a Cara" ("Saving Face")",
        "link": "https://www.imdb.com/review/rw1801795/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "LGBTQ+ Themes"],
        "movie": "Saving Face"
      },
      {
        "title": "n/a",
        "username": "RkwIJvulAfYMInyT40IQYFBATAG",
        "date": "2012-12-27",
        "reviewText": "Absolutely delightful. An American-Born-Chinese lesbian finds her world rocked when her widowed mother is disowned for getting pregnant out of wedlock. The story subverts stereotypes about race, gender, sexuality, and age, but it never seems to do too much. Enough time is spent on major and minor characters and plots. The end teeters on Joy Luck Club-level saccharine, but the performances are all nuanced and the bilingual script is seamless in mixing the elders' traditional Mandarin and the ABCs' mix of English and broken Mandarin. There is the requisite nagging Tiger Mom we've come to expect from Asian culture clash films, but Joan Chen brings a quieter, more sensual layer as well, since Ma is also back on the market. Michelle Krusiec, as the surgeon daughter, is brilliantly still and funny in a serious way. There are even a few mannerisms of hers that I know I do/did in my one short film acting experience. She, along with Carey Mulligan and Emmanuelle Béart, are actresses whose faces I'd like to wear, "Silence-of-the-Lambs"-style.",
        "link": "https://www.rottentomatoes.com/profiles/9XNFBeHMnh1PtwGfqmuGmTbjs8r",
        "tags": ["Cultural Identity", "Family Dynamics", "LGBTQ+ Themes", "Visual Appeal and Performances"],
        "movie": "Saving Face"
      }
    ]
  }
  