{
    "reviews": [
      {
        "title": "Brave drama that is seldom told",
        "username": "allan-36",
        "date": "2000-08-14",
        "reviewText": "Mina Shum's Double Happiness bravely explores a group that mainstream film (read: Hollywood) continues to ignore: Asians in North America. That the film features strong acting, good writing and confident direction makes its accomplishments all the more greater. You don't need to be Asian to enjoy this film, anymore than you have to be Italian to watch The Godfathers. Young women of whatever ethnic backgrounds are bound to identify with the lead character, finely played by Sandra Oh. The daughter-father conflict crosses all national boundaries, and is explored in this film through the eyes of Chinese-Canadians. I'm a Canadian of Chinese descent, and found the characterizations of the family to be accurate overall. At times, the domineering Father is one-dimensional (tyrannical and cold) and needed to be fleshed out more. The role of the siblings--especially towards their parents--was underplayed and could have offered a contrast to the main relationship between the elder daughter and Dad. Still, the strict traditionalism of the parents was on the nose, and the struggles of the daughter, Jade, ring true. In fact, I venture to say that Jade was played *too* obediently, and should have broken from her family sooner. Following this line of thought, the film could have been expanded to explore Jade moving into her own home and finding her own career as an actress, then reconciling (perhaps) with her stern Father at the end. As it stands, the movie ends abruptly and too soon. Shum and Oh do a fine job of getting Jade on the audience's side, only pull the carpet on her just as she leaves home. The movie begs for closure in the relationship between daughter and father. Perhaps in the sequel.",
        "link": "https://www.imdb.com/review/rw0337677/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "Immigrant Challenges"],
        "movie": "Double Happiness"
      },
      {
        "title": "Sandra Oh is mesmerizing",
        "username": "rosscinema",
        "date": "2003-04-26",
        "reviewText": "Mina Shum wrote and directed this story of a Chinese-Canadian family in Vancouver with the central character being Jade (Sandra Oh). Jade's father Quo (Stephen Chang) is very strict about his children following old Chinese traditions and if they don't then they are disowned by him. So Jade actually tries to live two separate lives, one an obedient daughter who goes along with her fathers wishes (For the most part) and when she is out with her friends she can be a normal woman in her early 20's who talk about boys and goes to clubs. Jade wants to be an actress much to the chagrin of her parents and she goes out on auditions. One night she meets a man named Mark who is white and they have a one night stand. Jade's parents do not know him at first and fix her up on dates with Chinese men. They're is some excellent visual imagery in the film and in one scene Jade and Mark are on swings and the shot is in slow motion with a good and effective musical score to enhance the visual flair. In another scene a fed up Jade gets out of the car of another date and starts to run down the street. We are not told where she is running to but we must assume its to Mark. Sandra Oh's performance seems to be flawless. Watching her character ultimately give up trying to please her father is just riveting to watch. I've always been a big fan of Oh's and I thought she was equally terrific in 'Dancing at the Blue Iguana'. Oh takes the character of Jade and makes her not only smart and strong, but makes her very human also! When a casting director asks her how could she possibly think of herself as Chinese if she cannot read it, Jade at this point in the film questions herself and ultimately comes to a life changing decision. Mina Shums script is sharp and she doesn't portray Jade's parents as one dimensional. They have issues as well and it affects the lives of their children. Well written script gives Oh the opportunity to give a totally convincing and haunting performance.",
        "link": "https://www.imdb.com/review/rw0337688/?ref_=tt_urv",
        "tags": ["Cultural Identity", "Family Dynamics", "Visual Appeal"],
        "movie": "Double Happiness"
      }
    ]
  }
  